Repository: davidwilby/WhoCanIVoteFor
Catalog: locale/*/LC_MESSAGES/django.po
Languages: cy

source: Enter your postcode
cy: Rhowch eich cod post

source: First-past-the-post
cy: Y Cyntaf i’r Felin

source: Additional Member System
cy: Y System Aelodau Ychwanegol

source: Supplementary Vote
cy: Pleidlais Atodol

source: Single Transferable Vote
cy: Pleidlais Sengl Drosglwyddadwy

source: The %(election)s %(was_or_will_be)s held on %(date)s.
cy: Cynhelir yr %(election)s %(was_or_will_be)s ar %(date)s.

source: The %(election)s <strong>is being held today</strong>. Polls are open from
cy: Cynhelir yr %(election)s <strong>heddiw</strong>. Bydd y gorsafoedd pleidleisio ar agor o

source: till
cy: tan

source: This election was held <strong>%(election_date)s</strong>.
cy: Cynhaliwyd yr etholiad hwn <strong>%(election_date)s</strong>

source: This election will be held on <strong>%(election_date)s</strong>.
cy: Bydd yr etholiad hwn yn cael ei gynnal <strong>%(election_date)s</strong>.

source: %(stood_or_standing)s for this election, in <strong>%(post_count)s</strong> posts.
cy: Ymgeisiodd%(stood_or_standing)s yn yr etholiad hwn, mewn <strong>%(post_count)s</strong> swydd.

source: Add more at our candidate crowd-sourcing site
cy: Ychwanegwch ragor ar ein gwefan torfoli ymgeiswyr

source: Add some candidates at our candidate crowd-sourcing site
cy: Ychwanegwch rai ymgeiswyr at ein gwefan torfoli ymgeiswyr

source: UK Elections
cy: Etholiadau'r DU

source: All Elections in the UK
cy: Pob Etholiad yn y DU

source: All Elections
cy: Pob Etholiad

source: This is a list of upcoming elections, and all elections Democracy Club has covered since 2010. The local election database was founded in 2016.
cy: Mae hon yn rhestr o'r etholiadau sydd i ddod, a phob etholiad y mae Democracy Club wedi'u cwmpasu oddi ar 2010. Sefydlwyd y gronfa ddata etholiadau lleol yn 2016.

source: The Additional Member System
cy: Y System Aelodau Ychwanegol

source: Add future elections in %(postcode)s to your calendar
cy: Ychwanegwch etholiadau'r dyfodol yn %(postcode)s at eich calendr

source: Manually subscribe by following these simple steps for your chosen calendar tool:
cy: Neu tanysgrifiwch â llaw drwy ddilyn y camau syml hyn ar gyfer eich offeryn calendr dewisol:

source: In your calendar app settings, choose the option for adding a new calendar.
cy: Yng ngosodiadau eich ap calendr, dewiswch yr opsiwn ar gyfer ychwanegu calendr newydd.

source: If presented with the option to choose a calendar type, choose web calendar.
cy: Os cewch eich cyflwyno â'r opsiwn i ddewis math o galendr, dewiswch galendr y we.

source: Enter this URL and save
cy: Rhowch yr URL hwn a'i arbed

source: Uncontested Election
cy: Etholiad Un Ymgeisydd

source: No votes will be cast, and the candidate%(pluralise_candidates)s below ha%(has_or_have)s been automatically declared the winner%(pluralise_candidates)s.
cy: Ni fydd unrhyw bleidleisiau'n cael eu bwrw, a datganwyd yn awtomatig mae'r ymgeisydd%(pluralise_candidates)s isod%(has_or_have)s yw'r enillydd%(pluralise_candidates)s.

source: Uncontested and Rescheduled Election
cy: Etholiad Heb Ymgeisydd ac Etholiad wedi'i Aildrefnu

source: Cancelled Election
cy: Etholiad Wedi'i Ganslo

source: This election was cancelled.
cy: Canslwyd yr etholiad hwn.

source: It was rescheduled for
cy: Fe'i haildrefnwyd ar gyfer

source: It will now take place on
cy: Bydd yn awr yn digwydd ar

source: Read more
cy: Darllenwch ragor

source: You are here
cy: Rydych chi yma

source: Home
cy: Cartref

source: Elections
cy: Etholiadau

source: How to vote
cy: Sut i bleidleisio

source: This election uses <a href="%(voting_system_url)s">%(voting_system_name)s</a>.
cy: Mae’r etholiad hwn yn defnyddio <a href="%(voting_system_url)s">%(voting_system_name)s</a>

source: Mark an X in the box for your preferred candidate.
cy: Nodwch X yn y blwch ar gyfer eich ymgeisydd dewisol.

source: Mark an X in the box for your preferred candidates.
cy: Nodwch X yn y blwch ar gyfer eich ymgeiswyr dewisol.

source: You can mark up to %(winner_count)s candidate.
cy: Gallwch nodi hyd at %(winner_count)s ymgeisydd.

source: Rank the candidates by your preference: 1, 2, 3… You don't have to rank all the candidates, but you must at least mark your first choice.
cy: Graddiwch yr ymgeiswyr yn ôl eich dewis: 1, 2, 3… Does dim rhaid i chi raddio'r holl ymgeiswyr, ond rhaid i chi o leiaf nodi eich dewis cyntaf.

source: Mark an X in the box for one party or independent candidate.
cy: Bydd gennych un bleidlais, a gallwch bleidleisio dros un blaid neu ymgeisydd annibynnol.

source: Read the instructions at the top of your ballot paper carefully.
cy: Darllenwch y cyfarwyddiadau ar frig eich papur pleidleisio yn ofalus.

source: Photo of %(pp.person.name)s
cy: Llun o %(pp.person.name)s

source: Elected:
cy: Etholwyd:

source: Party emblem
cy: Symbol y blaid

source: Show %(num_candidates)s candidates
cy: Dangos %(num_candidates)s ymgeiswyr

source: Elected
cy: Etholwyd

source: This candidate has been deselected by their party, but their original party description will remain on the ballot paper.
cy: Mae’r ymgeisydd hwn wedi’i ddad-ddewis gan ei blaid, ond ei blaid wreiddiol bydd y disgrifiad yn aros ar y papur pleidleisio.

source: Learn more
cy: Darllenwch ragor

source: Photo of %(person_name)s
cy: Llun o %(person_name)s

source: Where to vote
cy: Ble i bleidleisio

source: Your council is trialling a system that allows you to vote in person before polling day. You can vote in advance at this location, or vote at your polling station as normal on polling day.
cy: Mae eich cyngor yn treialu system sy'n caniatáu i chi bleidleisio'n bersonol o'r blaendiwrnod pleidleisio. Gallwch bleidleisio ymlaen llaw yn y lleoliad hwn, neu bleidleisio yn eich gorsaf bleidleisio fel arfer ar y diwrnod pleidleisio.

source: Vote before polling day
cy: Pleidleisiwch cyn y diwrnod pleidleisio

source: Your advance voting station is:
cy: Eich gorsaf bleidleisio ymlaen llaw yw:

source: Advance voting station opening times
cy: Amseroedd agor gorsafoedd pleidleisio

source: Date
cy: Dyddiad

source: Open
cy: Agor

source: Vote on polling day
cy: Pleidleisiwch ar y diwrnod pleidleisio

source: Your polling station is
cy: Eich gorsaf bleidleisio yw

source: It will be open from <strong>7am to 10pm</strong>.
cy: Bydd ar agor o <strong>7am tan 10pm</strong>.

source: and
cy: a

source: You don't need to take your poll card with you.
cy: Nid oes angen i chi ddod â'ch cerdyn pleidleisio gyda chi.

source: If you have a postal vote, you can hand it in at this polling station on election day up to 10pm. When handing in postal votes, you will need to complete a form, giving your name, address, how many postal votes you are handing in, and why you are handing in those postal votes.
cy: Os oes gennych bleidlais bost, gallwch ei chyflwyno yn yr orsaf bleidleisio hon ar ddiwrnod yr etholiad hyd at 10pm. Wrth gyflwyno pleidleisiau post, bydd angen i chi wneud hynnyllenwi ffurflen, gan roi eich enw, cyfeiriad, faint o bleidleisiau post yr ydych yn eucyflwyno, a pham yr ydych yn cyflwyno'r pleidleisiau post hynny.

source: Postal votes cannot be accepted at polling stations in Northern Ireland.
cy: Ni ellir derbyn pleidleisiau post mewn gorsafoedd pleidleisio yng Ngogledd Iwerddon.

source: Learn more about voting by post
cy: Dysgwch fwy am bleidleisio drwy'r post

source: <p>You can find your polling station by <a href="%(custom_finder)s"> following this link</a>. </p>
cy: <p>Gallwch ddod o hyd i'ch gorsaf bleidleisio drwy <a href="%(custom_finder)s"> ddilyn y ddolen hon</a>.</p>

source: <strong>Polling stations are open from %(open_time)s till %(close_time)s today.</strong>
cy: <strong>Bydd gorsafoedd pleidleisio ar agor o %(open_time)s tan %(close_time)s heddiw.</strong>

source: <p>Your polling station in %(postcode)s depends on your address. <a href="https://wheredoivote.co.uk/postcode/%(postcode)s/">Check the correct polling station for your address &raquo;</a></p>
cy: <p>Mae eich gorsaf bleidleisio yn %(postcode)s yn dibynnu ar eich cyfeiriad. <a href="https://wheredoivote.co.uk/postcode/%(postcode)s/">Gwiriwch yr orsaf bleidleisio gywir ar gyfer eich cyfeiriad&raquo;</a></p>

source: You should get a "poll card" through the post telling you where to vote.
cy: Dylech dderbyn "cerdyn pleidleisio" drwy'r post yn dweud ble y dylech chi bleidleisio.

source: If you haven't got one, or for questions about your poll card, polling place, or about returning your postal voting ballot, contact the Electoral Office for Northern Ireland <a href="tel:%(council_phone)s">%(council_phone)s</a>.
cy: Os nad oes gennych chi un, neu ddim yn siŵr ble i bleidleisio, dylech ffonio'r Swyddfa Cofrestru Etholiadol <a href="tel:%(council_phone)s">%(council_phone)s</a>.

source: If you haven't got one, or aren't sure where to vote, you should call %(council_name)s on <a href="tel:%(council_phone)s">%(council_phone)s</a>.
cy: Os nad oes gennych chi un, neu ddim yn siŵr ble i bleidleisio, dylech ffonio %(council_name)s ar <a href="tel:%(council_phone)s">%(council_phone)s</a>.

source: If you haven't got one, or aren't sure where to vote, you should call your local council.
cy: Os nad oes gennych chi un, neu ddim yn siŵr ble i bleidleisio, dylech ffonio eich cyngor lleol.

source: You will need photographic identification.
cy: Bydd angen dull adnabod ffotograffig arnoch.

source: Read more about how to vote in Northern Ireland
cy: Darllenwch fwy am sut i bleidleisio yng Ngogledd Iwerddon

source: Read more about how to vote
cy: Darllenwch fwy am sut i bleidleisio

source: %(election_name)s: This election has been cancelled.
cy: %(election_name)s: Canslwyd yr etholiad hwn.

source: See all %(num_candidates)s candidates in the %(election_name)s on %(election_date)s:
cy: Gweler yr holl%(num_candidates)s ymgeiswyr yn yr %(election_name)s ar %(election_date)s:

source: %(election_name)s: No candidates known yet.
cy: %(election_name)s: Nid yw'r ymgeiswyr yn hysbys eto.

source: %(election_name)s: This election has been cancelled.
cy: %(election_name)s: Canslwyd yr etholiad hwn

source: %(election_name)s: The %(num_candidates)s candidates in %(post_label)s
cy: %(election_name)s: Y %(num_candidates)s ymgeisydd yn%(post_label)s

source: Candidates in
cy: Yr ymgeiswyr yn

source: All elections where you live
cy: Pob etholiad ble rydych chi'n byw

source: Enter your postcode to get information about elections, your candidates and where to vote.
cy: Rhowch eich cod post i gael gwybodaeth am etholiadau, eich ymgeiswyr a ble i bleidleisio

source: Find your candidates
cy: Dod o hyd i'ch ymgeiswyr

source: Register to vote
cy: Cofrestru i bleidleisio

source: You need to be registered in order to vote. If you aren't registered to vote visit <a href="https://www.gov.uk/register-to-vote"> https://www.gov.uk/register-to-vote </a>
cy: Mae angen i chi fod wedi'ch cofrestru i bleidleisio. Os nad ydych wedi cofrestru i bleidleisio, ewch i <a href="https://www.gov.uk/register-to-vote"> https://www.gov.uk/register-to-vote </a>

source: Register before midnight on %(registration_deadline)s to vote on %(election_date)s.
cy: Cofrestrwch cyn hanner nos ar %(registration_deadline)s i bleidleisio ar %(election_date)s.

source: To register by post, contact %(council_name)s.
cy: I gofrestru drwy'r post, cysylltwch â %(council_name)s.

source: To register by post, contact your local council.
cy: I gofrestru drwy'r post, cysylltwch â'ch cyngor lleol.

source: For questions about your poll card, polling place, or about returning your postal voting ballot, contact your council.
cy: Ar gyfer cwestiynau ynghylch eich cerdyn pleidleisio, eich gorsaf bleidleisio, neu ynghylch dychwelyd eich pleidlais drwy'r post, cysylltwch â'ch cyngor.

source: Additional members
cy: Aelodau ychwanegol

source: This election <strong>is being held today</strong>. Polls are open from %(open_time)s till %(close_time)s
cy: Cynhelir yr etholiad hwn <strong>heddiw</strong>. Mae gorsafoedd pleidleisio ar agor o %(open_time)s tan %(close_time)s

source: This election will be held <strong>%(election_date)s</strong>.
cy: Bydd yr etholiad hwn yn cael ei gynnal <strong>%(election_date)s</strong>.

source: About this position
cy: Ynglŷn â'r rôl hon

source: <strong>%(num_candidates)s candidate%(plural)s</strong> stood in the %(postelection)s.
cy: Ymgeisiodd <strong>%(num_candidates)s ymgeisydd%(plural)s</strong> yn %(postelection)s.

source: We don't know of any candidates standing yet. You can help improve this page:
cy: Ni wyddwn am unrhyw ymgeiswyr sy'n sefyll eto. Gallwch helpu i wella'r dudalen hon:

source: add information about candidates to our database
cy: ychwanegwch wybodaeth am ymgeiswyr i'n cronfa ddata

source: We don't know of any candidates standing yet. The official candidate list will be published by %(expected_sopn_date)s, when this page will be updated. You can help improve this page:
cy: Gallwch helpu i wella'r dudalen hon:Ni wyddwn am unrhyw ymgeiswyr sy'n sefyll eto. Bydd y rhestr swyddogol o ymgeiswyr yn cael ei chyhoeddi erbyn %(expected_sopn_date)s, pan fydd y dudalen hon yn cael ei diweddaru.

source: You will have one vote, and can vote for a single party list or independent candidate.
cy: Bydd gennych un bleidlais, a gallwch bleidleisio dros un blaid neu ymgeisydd annibynnol.

source: You will have <strong>%(winner_count)s vote%(plural)s</strong>, and can choose from <strong>%(num_candidates)s candidate%(plural_candidates)s</strong>.
cy: Bydd gennych <strong>%(winner_count)s bleidlais%(plural)s</strong>, a gallwch ddewis o <strong>%(num_candidates)s ymgeisydd%(plural_candidates)s</strong>.

source: There is <strong>one seat</strong> up for election, and you can choose from <strong>%(num_ballots)s</strong>.
cy: Mae yna <strong>un sedd</strong> ar gael yn yr etholiad, a gallwch ddewis o <strong>%(num_ballots)s ymgeisydd</strong>.

source: There are <strong>%(winner_count)s seats</strong> up for election, and you can choose from <strong>%(num_ballots)s</strong>.
cy: Mae yna %(winner_count)s seddi sedd ar gael yn yr etholiad, a gallwch ddewis o %(num_ballots)s ymgeisydd.

source: We are currently aware of %(num_candidates)s candidate%(plural_candidates)s for this position.
cy: Ar hyn o bryd rydym yn ymwybodol o %(num_candidates)s ymgeisydd%(plural_candidates)s ar gyfer y swydd hon.

source: The official candidate list will be published by %(expected_sopn_date)s, when this page will be updated. Once nomination papers are published, we will manually verify each candidate. You can help improve this page: <a href="%(ynr_link)s"> add information about candidates to our database</a>.
cy: Bydd y rhestr ymgeiswyr swyddogol yn cael ei chyhoeddi gan %(expected_sopn_date)s, pryd y bydd y dudalen hon yn cael ei diweddaru. Unwaith y bydd papurau enwebu wedi'u cyhoeddi, rydym yn yn dilysu pob ymgeisydd â llaw. Gallwch helpu i wella'r dudalen hon: <a href="%(ynr_link)s"> ychwanegu gwybodaeth am ymgeiswyr i'n cronfa ddata</a>.

source: Read the official candidate booklet for this election.
cy: Darllenwch y llyfryn ymgeiswyr swyddogol ar gyfer yr etholiad hwn.

source: Electorate
cy: Nifer etholwyr

source: Ballot Papers Issued
cy: Bapurau pleidleisio

source: Spoilt Ballots
cy: Nifer y bleidleisiau a ddifethwyd

source: Turnout
cy: Cyfrif pleidleisiau

source: The official candidate list should have been published on
cy: Dylai'r rhestr swyddogol o ymgeiswyr fod wedi'i chyhoeddi ar

source: The official candidate list should be published on
cy: Dylai'r rhestr swyddogol o ymgeiswyr gael ei chyhoeddi ar

source: Can you vote in this election?
cy: A allwch chi bleidleisio yn yr etholiad hwn?

source: Age
cy: Oedran

source: You need to be over %(voter_age)s on the %(voter_age_date)s of %(election_date)s in order to vote in this election.
cy: Mae angen i chi fod dros %(voter_age)s ar %(voter_age_date)s %(election_date)s i bleidleisio yn yr etholiad hwn.

source: Citizenship
cy: Dinasyddiaeth

source: Read more on Wikipedia
cy: Darllenwch fwy ar Wikipedia

source: You will need to take photo ID to vote at a polling station in this election
cy: Bydd angen i chi dynnu llun ID i bleidleisio mewn gorsaf bleidleisio yn yr etholiad hwn

source: You do not need your poll card to vote. You must vote at your assigned polling station. <ul> <li>Read more about <a href="https://www.gov.uk/voting-in-the-uk/polling-stations">voting in Great Britain</a>.</li> <li>Read more about <a href="https://www.gov.uk/how-to-vote/photo-id-youll-need">photo ID</a>.</li> </ul>
cy: Nid oes angen eich cerdyn pleidleisio arnoch i bleidleisio. Rhaid i chi bleidleisio yn yr un a neilltuwyd i chiorsaf bleidleisio. Darllenwch fwy am <a href=" https://www.gov.uk/voting-in-the-uk/polling-stations">pleidleisio ym Mhrydain Fawr</a>.<li>Darllenwch fwy am <a href=" https://www.gov.uk/how-to-vote/photo-id-youll-angen ">ID llun</a>.</li></ul>

source: European Parliament election results
cy: Canlyniadau etholiadau Senedd Ewrop

source: The results of the UK European Parliament elections are published on the European Parliament's election results website.
cy: Cyhoeddir canlyniadau etholiadau'r DU ar gyfer Senedd Ewrop ar wefan canlyniadau etholiad Senedd Ewrop

source: View results
cy: Gweld y canlyniadau

source: We don't know of any upcoming elections in your area.
cy: Nid wyddwn am unrhyw etholiadau sydd i ddod

source: Select your address
cy: Dewiswch eich cyfeiriad

source: Elections in your area
cy: Etholiadau yn eich ardal

source: Recently past elections
cy: Etholiadau diweddar yn y gorffennol

source: You will have %(num_ballots)s ballot paper%(ballots_pluralised)s to fill out.
cy: Bydd gennych %(num_ballots)s papur pleidleisio%(ballots_pluralised)s i'w lenwi.

source: (uncontested)
cy: (dim cystadleuaeth)

source: (may be contested)
cy: (efallai y bydd cystadleuaeth)

source: Get ready to vote
cy: Ble i bleidleisio

source: Voter ID requirements
cy: Gofynion ID Pleidleisiwr

source: There may also be parish, town or community council elections in some areas.
cy: Efallai y bydd etholiadau cyngor plwyf, tref neu gymunedol mewn rhai ardaloedd.

source: emblem
cy: symbol

source: %(party_name)s's Facebook profile
cy: Tudalen Facebook %(party_name)s

source: Home page
cy: Hafan

source: %(party_name)s's home page
cy: Hafan %(party_name)s

source: Email
cy: E-bost

source: Party manifesto
cy: Maniffesto'r blaid

source: Find out more about the %(party_name)s in their %(manifesto)s.
cy: Dysgwch fwy am %(party_name)s yn eu %(manifesto)s.

source: Latest tweets
cy: Trydariadau diweddar

source: Tweets by
cy: Trydariadau gan

source: Candidates
cy: Ymgeiswyr

source: Next election
cy: Yr etholiad nesaf

source: The <a href="%(post_election_url)s">next election for %(postelection)s</a> is
cy: Cynhelir yr <a href="%(post_election_url)s">etholiad nesaf ar gyfer %(postelection)s</a>

source: being held today
cy: heddiw

source: due to take place on
cy: Mae disgwyl iddo gael ei gynnal ar

source: Report a problem with this page
cy: Rhoi gwybod am broblem gyda'r dudalen hon

source: More likely
cy: Yn fwy tebygol

source: Less likely
cy: Llai tebygol

source: I always vote (no change)
cy: Dwi bob amser yn pleidleisio (dim newid)

source: Did you find what you were looking for?
cy: A wnaethoch chi ddod o hyd i'r hyn roeddech chi'n chwilio amdano?

source: Has this service changed your likelihood of voting?
cy: A yw'r gwasanaeth hwn wedi newid eich tebygolrwydd o bleidleisio?

source: Please describe the problem you encountered
cy: Disgrifiwch y broblem y daethoch ar ei thraws

source: Can you tell us anything more?
cy: A allwch chi ddweud unrhyw beth arall i ni?

source: (Optional) Email address
cy: (Dewisol) Cyfeiriad e-bost

source: If you provide an email address, we may contact you to request more information or notify you of improvements related to this report. It will not be used for email marketing purposes.
cy: Os ydych yn darparu cyfeiriad e-bost, efallai y byddwn yn cysylltu â chi i ofyn am fwy gwybodaeth neu i roi gwybod i chi am welliannau sy'n gysylltiedig â'r adroddiad hwn. Bydd yn ddim i'w ddefnyddio at ddibenion marchnata e-bost.

source: Send feedback
cy: Anfonwch adborth

source: Thanks for your feedback!
cy: Diolch am eich adborth!

source: Election events
cy: Digwyddiadau etholiadol

source: You can meet candidates and question them at events (often known as 'hustings'). Here are some events that are taking place:
cy: Gallwch gwrdd ag ymgeiswyr a'u cwestiynu mewn digwyddiadau ar-lein (fe'u gelwir yn hystingiau). Dyma rai digwyddiadau sy'n digwydd:

source: (Past event)
cy: (digwyddiad yn y gorffennol)

source: See video or other info from this event.
cy: Gweld fideo neu wybodaeth arall o'r digwyddiad hwn.

source: News articles
cy: Erthyglau newyddion

source: You %(were_also_or_will_also_be)s able to vote for %(ward_seats)s councillors to sit
cy: Gallwch hefyd %(were_also_or_will_also_be)s bleidleisio dros gynghorwyr %(ward_seats)s i eistedd

source: You are also represented by %(ward_seats)s councillors
cy: Cewch hefyd eich cynrychioli gan gynghorwyr %(ward_seats)s

source: on <a href="%(parish_council_election_url)s">%(council_name)s</a>
cy: ar <a href="%(parish_council_election_url)s">%(council_name)s</a>

source: View the official list of candidates (PDF).
cy: Gweld y rhestr swyddogol o ymgeiswyr (PDF).

source: See who was elected
cy: Gweld pwy gafodd eu hethol

source: Parties
cy: Pleidiau

source: Current: %(party_name)s
cy: Ar hyn o bryd: %(party_name)s

source: %(num_candidates)s candidate%(pluralize_candidates)s in our database.
cy: %(num_candidates)s ymgeisydd%(pluralize_candidates)s yn ein cronfa ddata.

source: Independent candidates are unaffiliated with any political party.
cy: Nid yw ymgeiswyr annibynnol yn gysylltiedig ag unrhyw blaid wleidyddol.

source: An independent candidate may appear on the ballot paper as "%(ballot_name)s", or with no description at all.
cy: Gall ymgeisydd annibynnol ymddangos ar y papur pleidleisio fel "%(ballot_name)s", neu heb unrhyw ddisgrifiad o gwbl.

source: UK Political Parties
cy: Pleidiau Gwleidyddol y DU

source: List of candidates for UK Political Parties
cy: Rhestr o ymgeiswyr Pleidiau Gwleidyddol y DU

source: Current: Parties
cy: Ar hyn o bryd: Pleidiau

source: The following is a list of all political parties represented by candidates in Democracy Club's UK election database (est. 2015). This list includes registered and deregistered parties.
cy: Mae'r canlynol yn rhestr o'r holl bleidiau gwleidyddol a gynrychiolir gan ymgeiswyr yng nghronfa ddata’r Clwb Democratiaeth ar gyfer etholiadau’r DU (sefydlwyd yn 2015). Mae'r rhestr hon yn cynnwys pleidiau cofrestredig a rhai sydd wedi'u datgofrestru.

source: There are two party registers in the UK: a combined Great Britain register for England, Wales and Scotland, and a separate register for Northern Ireland. Parties in Great Britain can only field candidates in the nations they have specified in their entry.
cy: Mae dwy gofrestr o bleidiau yn y DU: cofrestr Prydain Fawr ar gyfer Cymru, Lloegr a'r Alban, a chofrestr ar wahân ar gyfer Gogledd Iwerddon. Gall pleidiau ym Mhrydain Fawr ond cynnig ymgeiswyr yn y gwledydd y maent wedi'u nodi yn eu cais.

source: A registered party may field candidates in elections.
cy: Gall plaid gofrestredig gynnig ymgeiswyr mewn etholiadau.

source: A deregistered party may no longer field candidates in elections.
cy: Ni chaiff plaid sydd wedi'i datgofrestru gael ymgeiswyr mewn etholiadau mwyach.

source: A party can become deregistered through choice, or because it failed to renew its annual registration status.
cy: Gall plaid gael ei datgofrestru trwy ddewis, neu oherwydd iddi fethu ag adnewyddu ei statws cofrestru blynyddol.
