Repository: davidwilby/WhoCanIVoteFor
Catalog: locale/*/LC_MESSAGES/django.po
Languages: cy

source: In some cases, parties have been deregistered and then subsequently reregistered; in these cases, the party will have an entry for each registration.
cy: Mewn rhai achosion, mae pleidiau wedi cael eu datgofrestru ac yna’u hailgofrestru wedi hynny; yn yr achosion hyn, bydd gan y blaid gofnod ar gyfer pob cofrestriad.

source: Party names and emblems are taken from the <a href="http://www.electoralcommission.org.uk/">Electoral Commission's register of political parties.
cy: Mae enwau ac arwyddluniau pleidiau yn cael eu cymryd o <a href="http://www.electoralcommission.org.uk/">gofrestr pleidiau gwleidyddol y Comisiwn Etholiadol.</a>

source: Alternative name: %(alt_name)s
cy: Enw arall: %(alt_name)s

source: Read more on wikipedia
cy: Darllenwch fwy ar wikipedia

source: This political party was deregistered on %(dereg_date)s, and can no longer field candidates.
cy: Cafodd y blaid wleidyddol hon ei dadgofrestru ar %(dereg_date)s, ac ni all gynnig ymgeiswyr mwyach.

source: View this party's entry in the register of political parties.
cy: Gweld cofnod y blaid hon yn y gofrestr o bleidiau gwleidyddol.

source: This party may appear on the ballot paper as "%(ballot_name)s", or any of the following names:
cy: Gall y blaid hon fod ar y papur pleidleisio fel "%(ballot_name)s", neu unrhyw un o’r enwau canlynol:

source: This party currently has no descriptions registered with the Electoral Commission.
cy: Nid oes gan y blaid hon unrhyw ddisgrifiadau wedi'u cofrestru gyda'r Comisiwn Etholiadol ar hyn o bryd.

source: These descriptions are no longer registered with the Electoral Commission and cannot be used:
cy: Nid yw'r disgrifiadau hyn bellach wedi'u cofrestru gyda'r Comisiwn Etholiadol ac ni ellir eu defnyddio.

source: Emblems
cy: Symbolau

source: This party currently has no emblems registered with the Electoral Commission.
cy: Ar hyn o bryd nid oes gan y blaid hon unrhyw symbolau wedi'u cofrestru gyda'r Comisiwn Etholiadol.

source: Previous Emblems
cy: Symbolau blaenorol

source: These emblems are no longer registered with the Electoral Commission and cannot be used:
cy: Nid yw'r symbolau hyn bellach wedi'u cofrestru gyda'r Comisiwn Etholiadol ac ni ellir eu defnyddio:

source: %(manifesto_country)s manifesto
cy: Maniffesto %(manifesto_country)s

source: website
cy: gwefan

source: in %(manifesto_language)s
cy: yn %(manifesto_language)s

source: PDF Version
cy: Fersiwn PDF

source: Easy Read version
cy: Fersiwn Hawdd ei Darllen

source: They are not affiliated with any political party, nor do they campaign on any political issues.
cy: Nid ydynt yn gysylltiedig ag unrhyw blaid wleidyddol, ac nid ydynt ychwaith yn ymgyrchu ar unrhyw faterion gwleidyddol.

source: The Speaker generally runs unopposed by the major parties.
cy: Mae'r Llefarydd yn gyffredinol yn rhedeg yn ddiwrthwynebiad o'r prif bleidiau.

source: Elected unopposed
cy: Wedi'i ethol yn ddiwrthwynebiad.

source: (Results due after %(date)s)
cy: (Disgwylir canlyniadau ar ôl %(date)s)

source: Elected (vote count not available)
cy: Nid yw'r cyfrif pleidleisiau ar gael

source: About %(name)s
cy: Ynglyn â %(name)s

source: <h4>Favourite Biscuit</h4> <p>%(biscuit)s</p>
cy: <h4>Hoff fisgedyn</h4> <p>%(biscuit)s</p>

source: online
cy: Ar-lein

source: %(person_name)s's personal Facebook
cy: Facebook personol %(person_name)s

source: %(person_name)s's Facebook page
cy: Tudalen Facebook %(person_name)s

source: Twitter
cy: Trydar

source: %(person_name)s's LinkedIn profile
cy: Tudalen LinkedIn %(person_name)s

source: %(person_name)s's home page
cy: Hafan %(person_name)s

source: %(person_name)s's blog
cy: Blog %(person_name)s

source: %(person_name)s's Instagram
cy: Instagram %(person_name)s

source: %(person_name)s's YouTube
cy: YouTube %(person_name)s

source: The party's candidate page for this person
cy: Tudalen ymgeisydd y blaid ar gyfer y person hwn

source: Party page for %(person_name)s
cy: Tudalen y blaid ar gyfer %(person_name)s

source: %(person_name)s's TikTok
cy: TikTok %(person_name)s

source: %(person_name)s's Threads
cy: Threads %(person_name)s

source: %(person_name)sBlueSky'
cy: BlueSky %(person_name)s

source: Other contact info
cy: Gwybodaeth gyswllt arall

source: %(person_name)s's email
cy: E-bost %(person_name)s

source: <dt>We don't have %(person_name)s's contact info.</dt>
cy: <dt>Nid oes gennym gyfeiriad e-bost %(person_name)s.</dt>

source: Can you add it?
cy: A allwch chi ei ychwanegu?

source: That's all we know! Will you help us find more about this candidate?
cy: Dyna'r cyfan a wyddwn! A allwch chi ein helpu i ddarganfod mwy am yr ymgeisydd hwn?

source: Our volunteers have been working hard to add information on as many candidates as possible, but they need help.
cy: Bu ein gwirfoddolwyr yn gweithio'n galed yn ychwanegu gwybodaeth ar gymaint â phosibl o ymgeiswyr, ond mae angen help arnynt.

source: If you can add information that should be on this page
cy: Os gallwch chi, ychwanegwch wybodaeth a ddylai fod ar y dudalen hon

source: - such as %(person)s's %(cta)s -
cy: - fel%(cta)s %(person)s -

source: please use our crowdsourcing website to add it.
cy: defnyddiwch ein gwefan torfoli i'w ychwanegu.

source: Add or edit details &raquo;
cy: Ychwanegwch neu golygwch fanylion &raquo;

source: %(election)s for
cy: %(election)s ar gyfer

source: profile photo of %(person)s
cy: Llun proffil %(person)s

source: %(person)s's local party is %(party_label)s.
cy: Plaid leol %(person)s yw %(party_label)s.

source: %(person)s is a %(party)s candidate.
cy: Mae %(person)s yn ymgeisydd ar ran y %(party)s.

source: Party Homepage
cy: Hafan y Blaid

source: %(party)s's website
cy: Gwefan y %(party)s

source: %(party)s's email
cy: E-bost y %(party)s

source: Contact page
cy: Tudalen gyswllt

source: %(party)s's contact page
cy: Tudalen gyswllt y %(party)s

source: Youtube page
cy: Tudalen Youtube

source: %(party)s's Youtube profile
cy: Tudalen Youtube y %(party)s

source: %(person_name)s was the %(party_name)s candidate. Find out more about their policies in the %(party_name)s manifesto.
cy: %(person_name)s oedd ymgeisydd y %(party_name)s. Dysgwch fwy am eu polisïau ym maniffesto'r %(party_name)s.

source: %(person_name)s is the %(party_name)s candidate. Find out more about their policies in the %(party_name)s manifesto.
cy: %(person_name)s oedd ymgeisydd y %(party_name)s. Dysgwch fwy am eu polisïau ym maniffesto'r %(party_name)s.

source: %(intro)sGet the latest information on this candidate at %(SITE_TITLE)s
cy: %(intro)sCael y wybodaeth ddiweddaraf am yr ymgeisydd hwn ar %(SITE_TITLE)s

source: %(person_name)s's policies
cy: Polisïau %(person_name)s

source: Statement to voters
cy: Datganiad i bleidleiswyr

source: Full statement
cy: Datganiad llawn

source: This statement was last updated on %(date)s.
cy: Diweddarwyd y datganiad hwn ddiwethaf ar %(date)s.

source: This statement was added by %(person_name)s, their team, or by a <a href="https://candidates.democracyclub.org.uk/volunteer/%(object.ynr_id)s"> Democracy Club volunteer</a>, based on information published by the candidate elsewhere.
cy: Ychwanegwyd y datganiad hwn gan %(person_name)s, eu tîm, neu gan un o <a href="https://candidates.democracyclub.org.uk/person/%(object.ynr_id)s">wirfoddolwyr Democracy Club</a>, yn seiliedig ar wybodaeth a gyhoeddwyd gan yr ymgeisydd mewn lle arall.

source: Record in office
cy: Record yn y swydd

source: See this candidate's
cy: Gweld record yr ymgeisydd hwn

source: record on TheyWorkForYou
cy: ar TheyWorkForYou

source: their speeches, voting history and more
cy: eu hareithiau, eu hanes pleidleisio a mwy

source: %(person_name)s's elections
cy: Etholiadau %(person_name)s

source: Election
cy: Etholiad

source: Party
cy: Plaid

source: Results
cy: Canlyniadau

source: Position
cy: Sefyllfa

source: We do not collect voting data for Supplementary Vote elections.
cy: Nid ydym yn casglu data pleidleisio ar gyfer etholiadau Pleidlais Atodol.

source: We do not collect voting data for Single Transferable Vote elections.
cy: Nid ydym yn casglu data pleidleisio ar gyfer etholiad Pleidlais Sengl Drosglwyddadwy.

source: Position not available
cy: Nid yw'r cyfrif pleidleisiau ar gael

source: Please note our local elections database only goes back to 2016.
cy: Sylwch fod ein cronfa ddata etholiadau lleol yn mynd yn ôl i 2016 yn unig.

source: %(name)s is the <a href="%(party_url)s">%(party_name)s</a> candidate for <a href="%(post_url)s">%(post_label)s</a> constituency in the <a href="%(election_url)s" title="%(election)s">%(election_name)s</a>.
cy: %(name)s yw ymgeisydd y <a href="%(party_url)s">%(party_name)s</a> ar gyfer etholaeth <a href="%(post_url)s">%(post_label)s</a> yn yr <a href="%(election_url)s" title="%(election)s">%(election_name)s</a>.

source: %(name)s was the <a href="%(party_url)s">%(party_name)s</a> candidate for <a href="%(post_url)s">%(post_label)s</a> constituency in the <a href="%(election_url)s" title="%(election)s">%(election_name)s</a>.
cy: %(name)s oedd ymgeisydd y <a href="%(party_url)s">%(party_name)s</a> ar gyfer etholaeth <a href="%(post_url)s">%(post_label)s</a> yn yr <a href="%(election_url)s" title="%(election)s">%(election_name)s</a>.

source: %(person_name)s is the <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> candidate for <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.
cy: %(person_name)s yw ymgeisydd y <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> ar gyfer <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.

source: %(person_name)s was the <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> candidate for <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.
cy: %(person_name)s oedd ymgeisydd y <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> ar gyfer <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.

source: %(person_name)s is a <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> candidate in <a href="%(post_url)s">%(post_label)s</a> constituency in the <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.
cy: Mae%(person_name)s yn ymgeisydd ar ran y <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> yn etholaeth <a href="%(post_url)s">%(post_label)s</a> yn yr <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.

source: %(person_name)s was a <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> candidate in <a href="%(post_url)s">%(post_label)s</a> constituency in the <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.
cy: Roedd%(person_name)s yn ymgeisydd ar ran y <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> yn etholaeth <a href="%(post_url)s">%(post_label)s</a> yn yr <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.

source: %(person_name)s is the Speaker seeking re-election in <a href="%(post_url)s">%(post_label)s</a> constituency in the <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.
cy: %(person_name)s yw'r Llefarydd sy'n ceisio cael ei ailethol ar gyfer etholaeth <a href="%(post_url)s">%(post_label)s</a> yn yr <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.

source: %(person_name)s was the Speaker seeking re-election in <a href="%(post_url)s">%(post_label)s</a> constituency in the <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.
cy: %(person_name)s oedd y Llefarydd a oedd yn ceisio cael ei ailethol ar gyfer etholaeth <a href="%(post_url)s">%(post_label)s</a> yn yr <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.

source: They were elected with <strong>%(num_votes)s</strong> votes.
cy: Fe'i hetholwyd gyda <strong>%(num_votes)s</strong> pleidlais.

source: They received <strong>%(num_votes)s</strong> votes.
cy: Fe dderbynion nhw <strong>%(num_votes)s</strong> pleidlais.

source: %(person_name)s is a <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> candidate in <a href="%(post_url)s">%(post_label)s</a> in the <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.
cy: Mae%(person_name)s yn ymgeisydd ar ran y <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> yn <a href="%(post_url)s">%(post_label)s</a> yn yr <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.

source: %(person_name)s was a <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> candidate in <a href="%(post_url)s">%(post_label)s</a> in the <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.
cy: Roedd%(person_name)s yn ymgeisydd ar ran y <a href="%(party_url)s" title="%(party_name)s">%(party_name)s</a> yn <a href="%(post_url)s">%(post_label)s</a> yn yr <a href="%(election_url)s" title="%(election_name)s">%(election_name)s</a>.

source: <p>%(person_name)s stood for election once.</p>
cy: <p>safodd %(person_name)s am etholiad unwaith.</p>

source: profile photo of %(object.name)s
cy: Llun proffil %(object.name)s

source: You are here:
cy: Rydych chi yma:

source: Back to candidates in
cy: Dychwelyd at ymgeiswyr yn

source: UK Prospective Parliamentary Candidates
cy: Darpar Ymgeiswyr Seneddol y DU

source: The next UK parliamentary general election is due to occur no later than January 2025, and political parties are currently selecting their candidates for each House of Commons constituency
cy: Mae disgwyl i etholiad cyffredinol seneddol nesaf y DU gael ei gynnal heb fod yn hwyrach nag Ionawr 2025, ac mae pleidiau gwleidyddol ar hyn o bryd yn dewis eu hymgeiswyr ar gyfer pob etholaeth yn Nhŷ'r Cyffredin

source: UK Prospective Parliamentary&nbsp;Candidates
cy: Darpar Ymgeiswyr Seneddol y DU&nbsp;

source: Democracy Club's volunteers are collecting information on each candidate as they are announced. The live tables below display all the candidates we are aware of. Where a candidate has a recent electoral history, this is displayed on their Democracy Club profile.
cy: Mae gwirfoddolwyr y Clwb Democratiaeth yn casglu gwybodaeth am bob ymgeisydd megis maen nhw wedi'u cyhoeddi. Mae'r tablau byw isod yn dangos yr holl ymgeiswyr ydyn ni yn ymwybodol o. Lle mae gan ymgeisydd hanes etholiadol diweddar, mae hynwedi'i arddangos ar broffil eu Clwb Democratiaeth.

source: Spotted an error? Think we’ve missed a candidate? Get in touch:
cy: Wnaethoch chi ddod o hyd i gamgymeriad? Meddwl ein bod ni wedi methu ymgeisydd? Cysylltwch:

source: More information about the general election
cy: Mwy o wybodaeth am yr etholiad cyffredinol

source: There are 650 constituencies in the House of Commons, and each constituency elects one Member of Parliament (MP). Following a recent redistribution, in the next election England will elect 543 MPs, Scotland will elect 57, Wales will elect 32, and Northern Ireland will elect 18."
cy: Mae 650 o etholaethau yn Nhŷ'r Cyffredin, a phob etholaethyn ethol un Aelod Seneddol (AS). Yn dilyn ailddosbarthu diweddar, yn yr etholiad nesaf bydd Lloegr yn ethol 543 AS, yr Alban yn ethol 57, CymruBydd yn ethol 32, a Gogledd Iwerddon yn ethol 18.

source: Boundary changes
cy: Newidiadau ffiniau

source: The next general election will be held on new constituency boundaries. See the
cy: Bydd yr etholiad cyffredinol nesaf yn cael ei gynnal ar ffiniau etholaethau newydd. Gweler y

source: website of the House of Commons Library
cy: gwefan Llyfrgell Tŷ’r Cyffredin

source: to find out what is happening to your constituency.
cy: i ddarganfod beth sy’n digwydd i’ch etholaeth.

source: MPs standing down
cy: Gweinidogion Seneddol yn sefyll i lawr

source: Some existing Members of Parliament have announced they will not be standing at the next election.
cy: Mae rhai Aelodau Seneddol presennol wedi cyhoeddi na fyddan nhw'n sefyllyn yr etholiad nesaf.

source: Visit the website of the Institute for Government for a full list
cy: Ewch i wefan Sefydliad y Llywodraeth am restr lawn

source: Timetable
cy: Amserlen

source: Democracy Club's <a href="%(election_timetable_url)s">general election timetable generator</a> provides an election timetable for any given date
cy: <a href="%(election_timetable_url)s">Etholiad cyffredinol Clwb Democratiaeth Mae cynhyrchydd amserlen</a> yn darparu amserlen etholiad ar gyfer unrhyw ddyddiad penodol

source: The data
cy: Y data

source: The full list of prospective parliamentary candidates is available as a <a href="%(details_url)s">browsable table</a> or a <a href="https://docs.google.com/spreadsheets/d/e/2PACX-1vRhZbBrU2AdJDYyBZViMs6irvH7zVUiZm2rDoADw5B18drp6hILJBr-duSXCmHJ18SmYWm3iq0bbfoR/pub?gid=0&single=true&output=csv">CSV</a>.
cy: Mae'r rhestr lawn o ddarpar ymgeiswyr seneddol ar gael fel a <a href="%(details_url)s"> tabl i bori</a> neu <a href="https://docs.google.com/spreadsheets/d/e/2PACX-1vRhZbBrU2AdJDYyBZViMs6irvH7zVUiZm2rDoADw5B18drp6hILJBr-duSXCmHJ18SmYWm3iq0bbfoR/pub?gid=0&single=true&output=csv">CSV</a>.

source: Please note this data is now archived. For the latest data, please refer to the <a href="https://whocanivotefor.co.uk/elections/parl.2024-07-04/uk-parliament-elections/">2024 General Election page</a>.
cy: Sylwer bod y data hwn bellach wedi'i archifo. Am y data diweddaraf, os gwelwch yn dda.cyfeiriwch at y <a href="https://whocanivotefor.co.uk/elections/parl.2024-07-04/uk-Senedd-etholiadau/">tudalen Etholiad Cyffredinol 2024</a>.

source: Number of candidates announced per UK region or nation
cy: Nifer yr ymgeiswyr a gyhoeddwyd fesul rhanbarth neu wlad yn y DU

source: Region / nation
cy: Rhanbarth / cenedl

source: Total seats in region
cy: Cyfanswm y seddi yn y rhanbarth

source: Candidate selections by political party
cy: Dethol ymgeiswyr yn ôl plaid wleidyddol

source: Total
cy: Cyfanswm

source: Support our work
cy: Cefnogwch ein gwaith

source: Democracy Club is a non-profit Community Interest Company. If you've found this resource useful, please consider a donation
cy: Mae Clwb Democratiaeth yn Gwmni Buddiannau Cymunedol di-elw. Os ydych chi wedi darganfod mae'r adnodd hwn yn ddefnyddiol, ystyriwch rodd os gwelwch yn dda

source: Donate now
cy: Cyfrannwch nawr

source: Democracy Club’s volunteers are collecting information on each candidate as they are announced
cy: Mae gwirfoddolwyr y Clwb Democratiaeth yn casglu gwybodaeth am bob ymgeisydd wrth iddynt gael eu cyhoeddi

source: Democracy Club's volunteers are collecting information on each candidate as they are announced.
cy: Mae gwirfoddolwyr y Clwb Democratiaeth yn casglu gwybodaeth am bob ymgeisydd wrth iddynt gael eu cyhoeddi.

source: The live table below displays all the candidates we are aware of.
cy: Mae'r tabl byw isod yn dangos yr holl ymgeiswyr yr ydym yn ymwybodol ohonynt.

source: Where a candidate has a recent electoral history, this is displayed on their Democracy Club profile, linked to from their name.
cy: Lle mae gan ymgeisydd hanes etholiadol diweddar, dangosir hyn ar eu Proffil Clwb Democratiaeth, yn gysylltiedig ag ef o’u henw.

source: Filters
cy: Hidlydd

source: You can also <a href="%(csv_url)s">download the CSV</a> of all prospective parliamentary candidates.
cy: Gallwch hefyd <a href="%(csv_url)s">lawrlwytho'r CSV</a> o'r holl ddarparymgeiswyr seneddol.

source: Name
cy: Enw

source: Constituency
cy: Etholaeth

source: Nation / English region
cy: Cenedl / rhanbarth Lloegr

source: Source
cy: Ffynhonnell

source: %(council_name)s governance referendum
cy: refferendwm llywodraethu %(council_name)s

source: Today
cy: Heddiw

source: voters in <strong>%(council_name)s</strong> able to vote in a governance referendum.
cy: roedd pleidleiswyr yn <strong>%(council_name)s</strong> yn gallu pleidleisio mewn refferendwm llywodraethu.

source: The question on the ballot paper was:
cy: Y cwestiwn ar y papur pleidleisio oedd:

source: The question you will be asked on the ballot paper is:
cy: Y cwestiwn a ofynnir i chi ar y papur pleidleisio yw:

source: Find more information on the %(council_name)s council website.
cy: Mae mwy o wybodaeth ar wefan %(council_name)s.

source: Here are some other links about the campaign that we know about:
cy: Dyma rai dolenni eraill am yr ymgyrch y gwyddwn amdanynt:

source: You will also be able to vote in a referendum
cy: Gallwch hefyd bleidleisio mewn refferendwm

source: You may also be able to vote in a referendum
cy: Gallech hefyd bleidleisio mewn refferendwm

source: %(council_name)s referendum
cy: Refferendwm%(council_name)s

source: Language:
cy: Iaith:

source: We're collecting results as they are published. Please check back later.
cy: Rydym yn casglu canlyniadau wrth iddynt gael eu cyhoeddi. Gwiriwch yn ôl yn nes ymlaen.

source: About %(SITE_TITLE)s
cy: Ynglŷn %(SITE_TITLE)s

source: Privacy
cy: Preifatrwydd

source: Source code
cy: Cod ffynhonnell

source: About Democracy Club
cy: Ynglŷn â'r Clwb Democratiaeth

source: Contact Us
cy: Cysylltwch â Ni

source: Browse the list of people and parties standing in the next general election
cy: Porwch y rhestr o bobl a phleidiau sy'n sefyll yn yr etholiad cyffredinol nesaf

source: All Parties
cy: Pob plaid

source: Standing as a candidate?
cy: Sefyll fel ymgeisydd?

source: Who Can I Vote For?
cy: Pwy alla i bleidleisio ar gyfer?

source: Find out about candidates in your area
cy: Cael gwybod am ymgeiswyr yn eich ardal chi

source: Sorry, we don't know the postcode %(postcode)s. Is there another one you can try?
cy: Mae'n flin gennym, ond nid ydym yn gwybod y cod post %(postcode)s . A oes un arall y gallwch chi ei ddefnyddio?

source: Upcoming Elections
cy: Etholiadau i ddod
